Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རིགས་ལ་རྣམ་པར་བལྟས་ནས། དགའ་ལྡན་གྱི་གནས་ཀྱི་གཞལ་མེད་ཁང་ཆེན་པོ་ཆུ་དང་རྒྱར་དཔག་ཚད་དྲུག་ཅུ་རྩ་བཞི་ཡོད་པ་གང་དུ་བྱང་ཆུབ་སེམས་དཔའ་འདུག་སྟེ། དགའ་ལྡན་གྱི་ལྷ་རྣམས་ལ་ཆོས་སྟོན་པ་རྒྱལ་མཚན་མཐོན་པོ་ཞེས་བྱ་བ་ཡོད་དེ།
en: Monks, while the Bodhisattva was seeing the family of his birth, he dwelt in the Heaven of Joy in Uccadhvaja, a great celestial palace measuring sixty-four leagues around, where he taught the Dharma to the gods of the Heaven of Joy.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་གཞལ་མེད་ཁང་ཆེན་པོ་དེར་སོང་ནས་ཕྱིན་པ་དང་། དགའ་ལྡན་གྱི་རིས་ཀྱི་ལྷའི་བུ་ཐམས་ཅད་ལ་སྨྲས་པ།
en: The Bodhisattva had come to this great celestial palace where he now addressed all the gods of the Heaven of Joy.

source: ཁྱེད་རྣམས་འདིར་འདུ་བར་གྱིས་ཤིག །འཆི་འཕོ་བའི་རྣམ་པར་སྦྱོར་བ་ཞེས་བྱ་བའི་ཆོས་རྗེས་སུ་དྲན་པ་ཆོས་རྗེས་སུ་བསྟན་པ་ཐ་མའི་ཆོས་མཉན་པ་བྱང་ཆུབ་སེམས་དཔའ་ལས་ཉོན་ཅིག །དེ་སྐད་ཀྱི་ཚིག་ཐོས་ནས།
en: “Come, gather here,” he said. “Come listen to the Bodhisattva’s final teaching on the Dharma, a recollection of the Dharma entitled ‘The Application of Passing.’ ”

source: དགའ་ལྡན་གྱི་རིས་ཀྱི་ལྷའི་བུ་ཐམས་ཅད་ལྷའི་བུ་མོའི་ཚོགས་དང་བཅས་ཏེ། གཞལ་མེད་ཁང་ཆེན་པོ་དེར་འདུས་སོ།
en: Hearing these words, all the gods in the Heaven of Joy, along with the assembly of goddesses, gathered together in the great celestial palace.

source: །དེར་བྱང་ཆུབ་སེམས་དཔས་འཁོར་གྱི་ཁྱམས་གླིང་བཞི་པ་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ཚད་ཙམ་དུ་ཡངས་པར་བྱིན་གྱིས་བརླབས་པར་གྱུར་ནས།
en: There the Bodhisattva blessed the surrounding area, which was as vast as the entire world with its four great continents.

source: དེ་དེ་ཙམ་དུ་བཟང་ཞིང་དེ་ཙམ་དུ་བལྟ་ན་སྡུག་ལ། དེ་ཙམ་དུ་རྒྱན་གྱིས་རྒྱས་ཤིང་དེ་ཙམ་དུ་ཡིད་དུ་འོང་བར་གྱུར་པ་དེས་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་ཐམས་ཅད་རང་རང་གི་ཁྱིམ་གྱི་བཀོད་པ་ལ་དུར་ཁྲོད་ལྟ་བུའི་འདུ་ཤེས་སྐྱེས་པར་གྱུར་ཏོ།
en: The area was so splendid, so beautiful to behold, so filled with ornaments, and so enchanting that all the gods of the desire and form realms came to think that their own homes seemed like charnel grounds in comparison.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རང་གི་བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པའི་རྒྱུ་འཐུན་པས་ཡོངས་སུ་བརྒྱན་པའི་སེང་གེའི་ཁྲི་ནོར་བུ་རིན་པོ་ཆེ་དུ་མས་རྩ་བ་སྤྲས་པ། ལྷའི་རས་བཅོས་བུའི་སྟན་དུ་མ་བཏིང་བ།
en: The Bodhisattva was seated upon a lion throne that was utterly resplendent as a result of the ripening of his merit. The base of the throne was bedecked with various precious jewels, and piles of cushions covered in celestial cloth sat upon it.

source: ལྷའི་སྤོས་ཞིམ་པོ་དུ་མས་བསྒོས་པ། བདུག་སྤོས་དམ་པ་མཆོག་ཏུ་བྱ་བ་དུ་མས་བདུགས་པ། ལྷའི་མེ་ཏོག་ཁ་དོག་དུ་མའི་དགྲམ་པ་བཀྲམ་པ།
en: Scented with the fragrant smells of various celestial perfumes and the finest of incense, the throne was covered with colorful and fragrant flowers.

source: ནོར་བུ་རིན་པོ་ཆེའི་འོད་བརྒྱ་སྟོང་དུ་མ་འབར་བའི་གཟི་བརྗིད་ཅན། ནོར་བུ་རིན་པོ་ཆེ་དུ་མའི་དྲ་བས་གཡོགས་པ། རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་དུ་མའི་སྒྲ་འབྱུང་བས་མངོན་པར་དགའ་བ་དང་ལྡན་པ། རིན་པོ་ཆེའི་དྲིལ་བུ་བརྒྱ་སྟོང་དུ་མ་མངོན་པར་དཀྲོལ་བའི་སྒྲ་དང་ལྡན་པ། རིན་པོ་ཆེའི་དྲ་བ་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་གསལ་བར་གྱུར་པ། རིན་པོ་ཆེའི་གདུགས་བརྒྱ་སྟོང་དུ་མས་ཀུན་ནས་བཀབ་པ།
en: It was magnificent indeed, glittering with the light of many hundreds of thousands of precious jewels, draped with nets of priceless gems, and giving off the sound of strings from jeweled chimes. Delightful to behold, the throne radiated the sounds of hundreds of thousands of jeweled bells, and it was covered with many hundreds of thousands of nets made of precious jewels.

source: དར་བརྒྱ་སྟོང་དུ་མ་རབ་ཏུ་སྤྱངས་པ། དར་གྱི་ཕྲེང་བ་ལྡ་ལྡི་བརྒྱ་སྟོང་དུ་མས་ཤིན་ཏུ་བརྒྱན་པ།
en: Hanging from it were many hundreds of thousands of silk streamers, and it was ornamented with many hundreds of thousands of silk tassels and garlands.

source: ལྷའི་བུ་མོ་བརྒྱ་སྟོང་དུ་མས་གླུ་བླངས། གར་བྱས། རོལ་མོ་བྱས་པ། ཡོན་ཏན་བརྒྱ་སྟོང་དུ་མ་ཀུན་ཏུ་བརྗོད་པ།
en: Hundreds of thousands of goddesses sang, danced, and played instruments, proclaiming hundreds of thousands of sublime qualities.

source: འཇིག་རྟེན་སྐྱོང་བ་བརྒྱ་སྟོང་དུ་མས་རྗེས་སུ་བསྲུངས་པ། བརྒྱ་བྱིན་བརྒྱ་སྟོང་དུ་མས་ཕྱག་བྱས་པ། ཚངས་པ་བརྒྱ་སྟོང་དུ་མས་རབ་ཏུ་བཏུད་པ།
en: Hundreds of thousands of guardians of the world stood watch, while hundreds of thousands of Śakras offered prostrations, and hundreds of thousands of Brahmās bowed down before the throne.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བཟུང་བ། ཕྱོགས་བཅུའི་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་མཐའ་ཡས་པས་དགོངས་པ།
en: Billions upon billions of bodhisattvas surrounded it, and billions upon billions of buddhas from the ten directions, infinite in number, focused their attention on it.

source: བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་པར་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཚོགས་སུ་བྱས་པའི་བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པའི་རྒྱུ་འཐུན་པ་ལས་བྱུང་བ་དེ་ལྟ་བུ་ལ་འདུག་གོ།
en: This throne came about due to the force of the ripening of merit amassed through the perfections carried out over billions upon billions of eons, indeed incalculable eons.

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེང་གེའི་ཁྲི་ཆེན་པོ་ཡོན་ཏན་དེ་ལྟ་བུ་དང་ལྡན་པ་ལ་འདུག་ནས་ལྷའི་འཁོར་ཆེན་པོ་དེ་དག་ལ་སྨྲས་པ།
en: Monks, in this way the Bodhisattva sat upon a grand lion throne with these qualities and spoke to the great gathering of gods.

source: གྲོགས་པོ་དག་བྱང་ཆུབ་སེམས་དཔའི་ལུས་བསོད་ནམས་བརྒྱའི་མཚན་གྱིས་ལེགས་པར་བརྒྱན་པ་ལ་ལྟོས།
en: “Friends,” he said, “look upon the body of the Bodhisattva, adorned as it is with the signs of a hundred merits.

source: ཤར་དང་། ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། འོག་དང་། སྟེང་དང་། ཕྱོགས་བཅུ་ཀུན་ན་བྱང་ཆུབ་སེམས་དཔའ་དགའ་ལྡན་གྱི་གནས་དམ་པ་ན་འཁོད་ཅིང་ཐམས་ཅད་ཀྱང་སྲིད་པ་ཐ་མ་པ་ལ་མངོན་དུ་ཕྱོགས་པ།
en: Look upon those innumerable and uncountable bodhisattvas who dwell in the ten directions, in the east, south, west, and north, above, below, and all around, and who are now in the sublime realm of the Heaven of Joy.

source: ལྷའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་འཆི་འཕོའི་རྣམ་པས་ལྷ་རྣམས་དགའ་བར་བྱེད་པའི་ཆོས་སྣང་བའི་སྒོ་ཡང་དག་པར་སྟོན་པ།
en: They are all approaching their final existence and, surrounded by an assembly of gods, they each delight the gods with the appearance of their passing, demonstrating the gateway to the light of Dharma.

source: ཚད་མེད་གྲངས་མེད་བགྲང་བ་ལས་འདས་པ་དག་ལ་ལྟོས།
en: Look upon them, countless, innumerable, and incalculable such as they are.”

source: དེ་ནས་ལྷའི་འཁོར་དེ་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་བྱིན་གྱིས་རླབས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་མཐོང་བར་གྱུར་ཏེ།
en: Then, through the blessings of the Bodhisattva, the entire assembly of gods saw all these bodhisattvas.

source: མཐོང་བར་གྱུར་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ།
en: Observing them, they faced the Bodhisattva, joined their palms, and bowed down before him.

source: ཡན་ལག་ལྔས་ཕྱག་འཚལ་ནས་འདི་སྐད་དུ་འདི་ལྟར་བདག་ཅག་གིས་བལྟས་པ་ཙམ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙེད་ཅིག་མཐོང་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བྱིན་གྱི་རླབས་བསམ་གྱིས་མི་ཁྱབ་པ་སྟེ། ལེགས་སོ་ཞེས་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་དོ། །
en: Prostrating with their entire bodies, they exclaimed, “How wondrous! The blessings of the Bodhisattva are indeed inconceivable, for we can see all these bodhisattvas by merely directing our gaze.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་ཡང་ལྷའི་འཁོར་ཆེན་པོ་དེ་དག་ལ་བོས་ནས་འདི་སྐད་ཅེས་སྨྲས་ཏེ།
en: The Bodhisattva then addressed the great assembly of gods with the following words:

source: གྲོགས་པོ་དག་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལྷའི་བུ་དེ་དག་ལ་གང་སྟོན་པ་འཆི་འཕོའི་རྣམ་པས་ལྷ་རྣམས་དགའ་བར་བྱེད་པའི་ཆོས་སྣང་བའི་སྒོ་ཉོན་ཅིག །གྲོགས་པོ་དག་ཆོས་སྣང་བའི་སྒོ་བརྒྱ་རྩ་བརྒྱད་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔས་འཆི་འཕོའི་དུས་ལ་བབ་པའི་ཚེ། ལྷའི་འཁོར་ལ་གདོན་མི་ཟ་བར་ཡང་དག་པར་བསྟན་པར་བྱ་བ་སྟེ།
en: “Friends, please listen to the gateways to the light of the Dharma that delight the gods, which these bodhisattvas teach the gods by the way in which they pass away. There are 108 gateways to the light of the Dharma, and they must be taught without fail to a gathering of gods by a bodhisattva at the time of his passing.

source: བརྒྱ་རྩ་བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these 108 gateways? They are as follows:

source: གྲོགས་པོ་དག་དད་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ་བསམ་པ་མི་ཕྱེད་པར་འགྱུར་རོ།
en: Faith, my friends, is a gateway to the light of Dharma, for with it one’s mind is unshakable.

source: །དང་བ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ་སེམས་རྙོག་པ་ཅན་དང་བར་འགྱུར་རོ།
en: Inspiration is a gateway to the light of the Dharma, for with it the mind is divested of impurities.

source: །མཆོག་ཏུ་དགའ་བ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ལུས་ཤིན་ཏུ་སྦྱངས་པར་འགྱུར་རོ།
en: Supreme joy is a gateway to the light of the Dharma, for with it the body becomes extremely pliable.

source: །དགའ་བ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སེམས་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: Contentment is a gateway to the light of the Dharma, for with it the mind becomes pure.

source: །ལུས་ཀྱི་སྡོམ་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ལུས་ཀྱི་ཉེས་པ་རྣམ་པ་གསུམ་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: Physical restraint is a gateway to the light of the Dharma, for with it the three physical faults are purified.

source: །ངག་གི་སྡོམ་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ངག་གི་ཉེས་པ་བཞི་ཡོངས་སུ་སྤོང་བར་འགྱུར་རོ།
en: Verbal restraint is a gateway to the light of the Dharma, for with it the four verbal faults are relinquished.

source: །ཡིད་ཀྱི་སྡོམ་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། བརྣབ་སེམས་དང་། གནོད་སེམས་དང་། ལོག་པར་ལྟ་བ་སྤོང་བར་འགྱུར་རོ།
en: Mental restraint is a gateway to the light of the Dharma, for with it covetousness, malice, and misguided views are abandoned.

source: །སངས་རྒྱས་རྗེས་སུ་དྲན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སངས་རྒྱས་མཐོང་བ་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: Recollection of the Buddha is a gateway to the light of the Dharma, for it leads to the pure perception of the Buddha.

source: །ཆོས་རྗེས་སུ་དྲན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཆོས་བསྟན་པ་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: Recollection of the Dharma is a gateway to the light of the Dharma, for it leads to the pure teaching of the Dharma.

source: །དགེ་འདུན་རྗེས་སུ་དྲན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སྐྱོན་མེད་པར་འཇུག་པར་འགྱུར་རོ།
en: Recollection of the Saṅgha is a gateway to the light of the Dharma, for it stops one from transgressing the rules.

source: །གཏོང་བ་རྗེས་སུ་དྲན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། རྫས་ཐམས་ཅད་རབ་ཏུ་སྤོང་བར་འགྱུར་རོ།
en: Recollection of giving is a gateway to the light of the Dharma, for it leads one to let go of all material things.

source: །ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Recollection of discipline is a gateway to the light of the Dharma, for it leads to the fulfillment of aspirations.

source: །ལྷ་རྗེས་སུ་དྲན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སེམས་རྒྱ་ཆེན་པོར་འགྱུར་རོ།
en: Recollection of the divine is a gateway to the light of the Dharma, for it leads to a vast mindset.

source: །བྱམས་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། རྫས་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པར་འགྱུར་རོ།
en: Love is a gateway to the light of the Dharma, for it surpasses all things created by merit based on material things.

source: །སྙིང་རྗེ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། རྣམ་པར་འཚེ་བ་མེད་པ་ལྷུར་ལེན་པར་འགྱུར་རོ།
en: Compassion is a gateway to the light of the Dharma, for it leads one to take up nonviolence.

source: །དགའ་བ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། མི་དགའ་བ་ཐམས་ཅད་སེལ་བར་འགྱུར་རོ།
en: Joy is a gateway to the light of the Dharma, for it clears away all displeasure.

source: །བཏང་སྙོམས་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། འདོད་པ་ལ་སྨོད་པར་འགྱུར་རོ།
en: Equanimity is a gateway to the light of the Dharma, for it leads to contempt for desire.

source: །མི་རྟག་པར་སོ་སོར་རྟོག་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། འདོད་པ་དང་། གཟུགས་ཡོད་པ་དང་། གཟུགས་མེད་པའི་འདོད་ཆགས་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་རོ།
en: Investigating impermanence is a gateway to the light of the Dharma, for it leads to the transcendence of the attachment of the desire, form, and formless realms.

source: །སྡུག་བསྔལ་དུ་སོ་སོར་རྟོག་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སྨོན་ལམ་ཀུན་ཏུ་ཆད་པར་འགྱུར་རོ།
en: Investigating suffering is a gateway to the light of the Dharma, for it leads to the cessation of misguided goals.

source: །བདག་མེད་པར་སོ་སོར་རྟོག་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། བདག་ལ་མངོན་པར་ཞེན་པ་མེད་པར་འགྱུར་རོ།
en: Investigating the absence of self is a gateway to the light of the Dharma, for it eliminates overt fixation on the self.

source: །ཞི་བར་སོ་སོར་རྟོག་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། རྗེས་སུ་ཆགས་པ་འབར་བ་མེད་པར་འགྱུར་རོ།
en: Investigating peace is a gateway to the light of the Dharma, for it dampens the flames of passion.

source: །ངོ་ཚ་ཤེས་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ནང་ཉེ་བར་ཞི་བར་འགྱུར་རོ།
en: Having a good conscience is a gateway to the light of the Dharma, for it brings complete inner peace.

source: །ཁྲེལ་ཡོད་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཕྱི་རོལ་ཉེ་བར་ཞི་བར་འགྱུར་རོ།
en: Modesty is a gateway to the light of the Dharma, for it brings complete peace in others.

source: །བདེན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ལྷ་དང་མི་རྣམས་མི་སླུ་བར་འགྱུར་རོ།
en: Truth is a gateway to the light of the Dharma, for with it gods and humans are not deceived.

source: །ཡང་དག་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། བདག་ལ་སླུ་བ་མེད་པར་འགྱུར་རོ།
en: The authentic is a gateway to the light of the Dharma, for with it one is not deceived.

source: །ཆོས་སྤྱད་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཆོས་ལ་རྟོན་པར་འགྱུར་རོ།
en: Dharma practice is a gateway to the light of the Dharma, for with it one relies upon the Dharma.

source: །གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ངན་སོང་གསུམ་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་རོ།
en: Going to the Three Jewels for refuge is a gateway to the light of the Dharma, for it enables one to transcend the three lower realms.

source: །བྱས་པ་གཟོ་བ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། དགེ་བའི་རྩ་བ་བྱས་པ་རྣམས་ཆུད་མི་ཟ་བར་འགྱུར་རོ།
en: Acknowledging the kindness of others is a gateway to the light of the Dharma, for it ensures that the basic virtues one has engaged in do not go to waste.

source: །བྱས་པ་རིག་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། གཞན་ལ་བརྙས་པ་མེད་པར་འགྱུར་རོ།
en: Gratitude is a gateway to the light of the Dharma, for it leads one to not condemn others.

source: །བདག་ཤེས་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། བདག་ལ་སྟོད་པ་མེད་པར་འགྱུར་རོ།
en: Knowing oneself is a gateway to the light of the Dharma, for it leads one to not praise oneself.

source: །སེམས་ཅན་ཤེས་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། གཞན་ལ་སྨོད་པ་མེད་པར་འགྱུར་རོ།
en: Knowing sentient beings is a gateway to the light of the Dharma, for it leads one to not belittle others.

source: །ཆོས་ཤེས་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་ལ་ནན་ཏན་བྱེད་པར་འགྱུར་རོ།
en: Knowing the Dharma is a gateway to the light of the Dharma, for it leads one to apply the Dharma assiduously and in the correct manner.

source: །དུས་ཤེས་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། མཐོང་བ་དོན་ཡོད་པར་འགྱུར་རོ།
en: Knowing the right time is a gateway to the light of the Dharma, for it ensures that seeing will be meaningful.

source: །ང་རྒྱལ་བཅོམ་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Conquering pride is a gateway to the light of the Dharma, for it leads to the perfection of wisdom.

source: །ཞེ་འགྲས་པ་མེད་པའི་སེམས་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། བདག་དང་གཞན་རྗེས་སུ་སྲུང་བར་འགྱུར་རོ།
en: A mind free from vindictiveness is a gateway to the light of the Dharma, for it allows one to protect both oneself and others.

source: །ཁོན་དུ་མི་འཛིན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། འགྱོད་པ་མེད་པར་འགྱུར་རོ།
en: Not holding grudges is a gateway to the light of the Dharma, for it allows one to be free from regret.

source: །མོས་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཐེ་ཚོམ་མེད་པར་ལྷུར་ལེན་པར་འགྱུར་རོ།
en: Sincere interest is a gateway to the light of the Dharma, for it enables one to make great effort and be free from doubt.

source: །མི་སྡུག་པར་སོ་སོར་རྟོག་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། འདོད་པ་ལ་རྣམ་པར་རྟོག་པ་སྤོང་བར་འགྱུར་རོ།
en: Investigating repulsiveness is a gateway to the light of the Dharma, for it enables one to dispense with thoughts about what one desires.

source: །གནོད་སེམས་མེད་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། གནོད་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་སྤོང་བར་འགྱུར་རོ།
en: Absence of malice is a gateway to the light of the Dharma, for it enables one to dispense with vengeful thoughts.

source: །གཏི་མུག་མེད་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། མི་ཤེས་པ་རྣམ་པར་སེལ་བར་འགྱུར་རོ།
en: Absence of stupidity is a gateway to the light of the Dharma, for it clears away ignorance.

source: །ཆོས་དོན་དུ་གཉེར་བ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། དོན་ལ་རྟོན་པར་འགྱུར་རོ།
en: Pursuit of the Dharma is a gateway to the light of the Dharma, for it enables one to rely upon the meaning.

source: །ཆོས་འདོད་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཆོས་སྣང་བ་ཐོབ་པར་འགྱུར་རོ།
en: Desiring the Dharma is a gateway to the light of the Dharma, for it leads one to connect to the light of the Dharma.

source: །ཐོས་པ་ཚོལ་བ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཚུལ་བཞིན་དུ་ཆོས་ལ་སོ་སོར་རྟོག་པར་འགྱུར་རོ།
en: Seeking to listen is a gateway to the light of the Dharma, for it enables one to investigate the Dharma precisely and in the correct manner.

source: །ཡང་དག་པའི་སྦྱོར་བ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཡང་དག་པར་ནན་ཏན་བྱེད་པར་འགྱུར་རོ།
en: Correct application is a gateway to the light of the Dharma, for it leads to the right conduct.

source: །མིང་དང་གཟུགས་ཡོངས་སུ་ཤེས་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཆགས་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་རོ།
en: Knowledge of names and forms is a gateway to the light of the Dharma, for it enables one to transcend all attachment.

source: །རྒྱུར་ལྟ་བ་ཡང་དག་པར་འཇོམས་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། རིག་པ་དང་རྣམ་པར་གྲོལ་བ་ཐོབ་པར་འགྱུར་རོ།
en: Conquering views about causes is a gateway to the light of the Dharma, for it leads to the attainment of awareness and complete liberation.

source: །རྗེས་སུ་ཆགས་པ་དང་ཁོང་ཁྲོ་བ་སྤོང་བ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། མཐོ་བར་སེམས་པ་མེད་ཅིང་དམའ་བར་སེམས་པ་མེད་པར་འགྱུར་རོ།
en: The elimination of attachment and aversion is a gateway to the light of the Dharma, for it eliminates judgmental thoughts.

source: །ཕུང་པོ་ལ་མཁས་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སྡུག་བསྔལ་ཡོངས་སུ་ཤེས་པར་འགྱུར་རོ།
en: Expertise concerning the aggregates is a gateway to the light of the Dharma, for it leads to thorough understanding of suffering.

source: །ཁམས་མཉམ་པ་ཉིད་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཀུན་འབྱུང་བ་སྤོང་བར་འགྱུར་རོ།
en: Equality of the elements is a gateway to the light of the Dharma, for it leads to the relinquishment of the source of suffering.

source: །སྐྱེ་མཆེད་གསལ་བ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ལམ་སྒོམ་པར་འགྱུར་རོ།
en: Withdrawal of the senses is a gateway to the light of the Dharma, for it leads one to meditate on the path.

source: །མི་སྐྱེ་བའི་བཟོད་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། འགོག་པ་མངོན་དུ་བྱེད་པར་འགྱུར་རོ།
en: Acceptance of nonarising is a gateway to the light of the Dharma, for it leads to the actualization of cessation.

source: །ལུས་ལ་སོང་བའི་དྲན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ལུས་དབེན་པར་འགྱུར་རོ།
en: Mindfulness of the body is a gateway to the light of the Dharma, for it leads to physical isolation.

source: །ཚོར་བ་ལ་སོང་བའི་དྲན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཚོར་བ་ཐམས་ཅད་རྒྱུན་ཆད་པར་འགྱུར་རོ།
en: Mindfulness of sensations is a gateway to the light of the Dharma, for it leads to the cessation of all sensations.

source: །སེམས་ལ་སོང་བའི་དྲན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སེམས་ལ་སྒྱུ་མ་ལྟ་བུར་སོ་སོར་རྟོག་པར་འགྱུར་རོ།
en: Mindfulness of the mind is a gateway to the light of the Dharma, for it leads to a precise understanding of the mind’s illusory nature.

source: །ཆོས་ལ་སོང་བའི་དྲན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། རབ་རིབ་དང་བྲལ་བའི་ཡེ་ཤེས་སུ་འགྱུར་རོ།
en: Mindfulness of phenomena is a gateway to the light of the Dharma, for it leads to unimpaired wisdom.

source: །ཡང་དག་པའི་སྤོང་བ་བཞི་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤོང་བ་དང་དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: The four thorough relinquishments are gateways to the light of the Dharma, for they enable one to relinquish all nonvirtuous qualities and to perfect all virtuous qualities.

source: །རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ལུས་དང་སེམས་ཡང་བར་འགྱུར་རོ།
en: The four bases of miraculous power are gateways to the light of the Dharma, for they lead to lightness of body and mind.

source: །དད་པའི་དབང་པོ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། གཞན་གྱི་དྲིང་མི་འཇོག་པར་འགྱུར་རོ།
en: The faculty of faith is a gateway to the light of the Dharma, for it leads one to not depend on the guidance of others.

source: །བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཤིན་ཏུ་རྟོགས་པའི་ཡེ་ཤེས་དང་ལྡན་པར་འགྱུར་རོ།
en: The faculty of diligence is a gateway to the light of the Dharma, for it endows one with the wisdom of realization.

source: །དྲན་པའི་དབང་པོ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ལས་ལེགས་པར་བྱས་པར་འགྱུར་རོ།
en: The faculty of mindfulness is a gateway to the light of the Dharma, for it leads one to engage in wholesome deeds.

source: །ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སེམས་རྣམ་པར་གྲོལ་བར་འགྱུར་རོ།
en: The faculty of absorption is a gateway to the light of the Dharma, for it leads to the liberation of mind.

source: །ཤེས་རབ་ཀྱི་དབང་པོ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། མངོན་སུམ་གྱི་ཡེ་ཤེས་སུ་འགྱུར་རོ།
en: The faculty of knowledge is a gateway to the light of the Dharma, for it leads to the wisdom of direct perception.

source: །དད་པའི་སྟོབས་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། བདུད་ཀྱི་སྟོབས་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་རོ།
en: The power of faith is a gateway to the light of the Dharma, for it leads to the thorough transcendence of the power of Māra.

source: །བརྩོན་འགྲུས་ཀྱི་སྟོབས་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: The power of diligence is a gateway to the light of the Dharma, for with it one will not turn back.

source: །དྲན་པའི་སྟོབས་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། མི་འཕྲོགས་པར་འགྱུར་རོ།
en: The power of mindfulness is a gateway to the light of the Dharma, for with it one will not be led astray.

source: །ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། རྣམ་པར་རྟོག་པ་ཐམས་ཅད་སྤོང་བར་འགྱུར་རོ།
en: The power of absorption is a gateway to the light of the Dharma, for with it one will relinquish all discursive thinking.

source: །ཤེས་རབ་ཀྱི་སྟོབས་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། མི་ཐུལ་བར་འགྱུར་རོ།
en: The power of knowledge is a gateway to the light of the Dharma, for with it one will not be easily deceived.

source: །དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཆོས་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པར་འགྱུར་རོ།
en: The branch of awakening of complete mindfulness is a gateway to the light of the Dharma, for it enables one to understand the Dharma as it is.

source: །ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: The branch of awakening of the complete discernment of the Dharma is a gateway to the light of the Dharma, for it enables one to accomplish all Dharmas.

source: །བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཤིན་ཏུ་རྟོགས་པའི་བློ་དང་ལྡན་པར་འགྱུར་རོ།
en: The branch of awakening of complete diligence is a gateway to the light of the Dharma, for it endows one with the intelligence of perfect realization.

source: །དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཏིང་ངེ་འཛིན་སྒྲུབ་པར་འགྱུར་རོ།
en: The branch of awakening of complete joy is a gateway to the light of the Dharma, for it enables one to accomplish absorption.

source: །ཤིན་དུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། བྱ་བ་བྱས་པར་འགྱུར་རོ།
en: The branch of awakening of complete agility is a gateway to the light of the Dharma, for it enables one to accomplish one’s endeavors.

source: །ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ།
en: The branch of awakening of complete absorption is a gateway to the light of the Dharma, for it enables one to comprehend the equality of all phenomena.

source: །བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སྐྱེ་བ་ཐམས་ཅད་ལ་སྨོད་པར་འགྱུར་རོ།
en: The branch of awakening of complete equanimity is a gateway to the light of the Dharma, for it leads to distaste for all births.

source: །ཡང་དག་པའི་ལྟ་བ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སྐྱོན་མེད་པར་འཇུག་པར་འགྱུར་རོ།
en: Right view is a gateway to the light of the Dharma, for it prevents one from transgressing the rules.
